zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_bus.h
/** @defgroup BUS_LL_EF_AHB2 AHB2
  * @{
  */

/**
  * @brief  Enable AHB2 peripherals clock.
  * @rmtoll MC_AHB2ENSETR      DMA1          LL_AHB2_GRP1_EnableClock\n
  *         MC_AHB2ENSETR      DMA2          LL_AHB2_GRP1_EnableClock\n
  *         MC_AHB2ENSETR      DMAMUX        LL_AHB2_GRP1_EnableClock\n
  *         MC_AHB2ENSETR      ADC12         LL_AHB2_GRP1_EnableClock\n
  *         MC_AHB2ENSETR      USBO          LL_AHB2_GRP1_EnableClock\n
  *         MC_AHB2ENSETR      SDMMC3        LL_AHB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_AHB2ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_AHB2ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clock is enabled or not
  * @rmtoll MC_AHB2ENSETR      DMA1          LL_AHB2_GRP1_IsEnabledClock\n
  *         MC_AHB2ENSETR      DMA2          LL_AHB2_GRP1_IsEnabledClock\n
  *         MC_AHB2ENSETR      DMAMUX        LL_AHB2_GRP1_IsEnabledClock\n
  *         MC_AHB2ENSETR      ADC12         LL_AHB2_GRP1_IsEnabledClock\n
  *         MC_AHB2ENSETR      USBO          LL_AHB2_GRP1_IsEnabledClock\n
  *         MC_AHB2ENSETR      SDMMC3        LL_AHB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->MC_AHB2ENSETR, Periphs) == Periphs);
}

/**
  * @brief  Disable AHB2 peripherals clock.
  * @rmtoll MC_AHB2ENCLRR      DMA1          LL_AHB2_GRP1_DisableClock\n
  *         MC_AHB2ENCLRR      DMA2          LL_AHB2_GRP1_DisableClock\n
  *         MC_AHB2ENCLRR      DMAMUX        LL_AHB2_GRP1_DisableClock\n
  *         MC_AHB2ENCLRR      ADC12         LL_AHB2_GRP1_DisableClock\n
  *         MC_AHB2ENCLRR      USBO          LL_AHB2_GRP1_DisableClock\n
  *         MC_AHB2ENCLRR      SDMMC3        LL_AHB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_AHB2ENCLRR, Periphs);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @rmtoll AHB2RSTSETR     DMA1        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR     DMA2        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR     DMAMUX      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR     ADC12       LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR     USBO        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR     SDMMC3      LL_AHB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB2RSTSETR, Periphs);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @rmtoll AHB2RSTCLRR     DMA1        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR     DMA2        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR     DMAMUX      LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR     ADC12       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR     USBO        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR     SDMMC3      LL_AHB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB2RSTCLRR, Periphs);
}

/**
  * @brief  Enable AHB2 peripheral clocks in Sleep mode
  * @rmtoll MC_AHB2LPENSETR    DMA1       LL_AHB2_GRP1_EnableClockSleep\n
  *         MC_AHB2LPENSETR    DMA2       LL_AHB2_GRP1_EnableClockSleep\n
  *         MC_AHB2LPENSETR    DMAMUX     LL_AHB2_GRP1_EnableClockSleep\n
  *         MC_AHB2LPENSETR    ADC12      LL_AHB2_GRP1_EnableClockSleep\n
  *         MC_AHB2LPENSETR    USBO       LL_AHB2_GRP1_EnableClockSleep\n
  *         MC_AHB2LPENCLRR    SDMMC3     LL_AHB2_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_AHB2LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_AHB2LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB2 peripheral clocks in Sleep mode
  * @rmtoll MC_AHB2LPENCLRR    DMA1       LL_AHB2_GRP1_DisableClockSleep\n
  *         MC_AHB2LPENCLRR    DMA2       LL_AHB2_GRP1_DisableClockSleep\n
  *         MC_AHB2LPENCLRR    DMAMUX     LL_AHB2_GRP1_DisableClockSleep\n
  *         MC_AHB2LPENCLRR    ADC12      LL_AHB2_GRP1_DisableClockSleep\n
  *         MC_AHB2LPENCLRR    USBO       LL_AHB2_GRP1_DisableClockSleep\n
  *         MC_AHB2LPENCLRR    SDMMC3     LL_AHB2_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_AHB2LPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB3 AHB3
  * @{
  */

/**
  * @brief  Enable AHB3 peripherals clock.
  * @rmtoll MC_AHB3ENSETR      DCMI       LL_AHB3_GRP1_EnableClock\n
  *         MC_AHB3ENSETR      CRYP2      LL_AHB3_GRP1_EnableClock\n
  *         MC_AHB3ENSETR      HASH2      LL_AHB3_GRP1_EnableClock\n
  *         MC_AHB3ENSETR      RNG2       LL_AHB3_GRP1_EnableClock\n
  *         MC_AHB3ENSETR      CRC2       LL_AHB3_GRP1_EnableClock\n
  *         MC_AHB3ENSETR      HSEM       LL_AHB3_GRP1_EnableClock\n
  *         MC_AHB3ENSETR      IPCC       LL_AHB3_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_AHB3ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_AHB3ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB3 peripheral clock is enabled or not
  * @rmtoll MC_AHB3ENSETR      DCMI       LL_AHB3_GRP1_IsEnabledClock\n
  *         MC_AHB3ENSETR      CRYP2      LL_AHB3_GRP1_IsEnabledClock\n
  *         MC_AHB3ENSETR      HASH2      LL_AHB3_GRP1_IsEnabledClock\n
  *         MC_AHB3ENSETR      RNG2       LL_AHB3_GRP1_IsEnabledClock\n
  *         MC_AHB3ENSETR      CRC2       LL_AHB3_GRP1_IsEnabledClock\n
  *         MC_AHB3ENSETR      HSEM       LL_AHB3_GRP1_IsEnabledClock\n
  *         MC_AHB3ENSETR      IPCC       LL_AHB3_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB3_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->MC_AHB3ENSETR, Periphs) == Periphs);
}

/**
  * @brief  Disable AHB3 peripherals clock.
  * @rmtoll MC_AHB3ENCLRR      DCMI       LL_AHB3_GRP1_DisableClock\n
  *         MC_AHB3ENCLRR      CRYP2      LL_AHB3_GRP1_DisableClock\n
  *         MC_AHB3ENCLRR      HASH2      LL_AHB3_GRP1_DisableClock\n
  *         MC_AHB3ENCLRR      RNG2       LL_AHB3_GRP1_DisableClock\n
  *         MC_AHB3ENCLRR      CRC2       LL_AHB3_GRP1_DisableClock\n
  *         MC_AHB3ENCLRR      HSEM       LL_AHB3_GRP1_DisableClock\n
  *         MC_AHB3ENCLRR      IPCC       LL_AHB3_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_AHB3ENCLRR, Periphs);
}

/**
  * @brief  Force AHB3 peripherals reset.
  * @rmtoll AHB3RSTSETR     DCMI       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTSETR     CRYP2      LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTSETR     HASH2      LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTSETR     RNG2       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTSETR     CRC2       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTSETR     HSEM       LL_AHB3_GRP1_ForceReset\n
  *         AHB3RSTSETR     IPCC       LL_AHB3_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB3RSTSETR, Periphs);
}

/**
  * @brief  Release AHB3 peripherals reset.
  * @rmtoll AHB3RSTCLRR     DCMI       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTCLRR     CRYP2      LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTCLRR     HASH2      LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTCLRR     RNG2       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTCLRR     CRC2       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTCLRR     HSEM       LL_AHB3_GRP1_ReleaseReset\n
  *         AHB3RSTCLRR     IPCC       LL_AHB3_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB3RSTCLRR, Periphs);
}

/**
  * @brief  Enable AHB3 peripheral clocks in Sleep mode
  * @rmtoll MC_AHB3LPENSETR    DCMI       LL_AHB3_GRP1_EnableClockSleep\n
  *         MC_AHB3LPENSETR    CRYP2      LL_AHB3_GRP1_EnableClockSleep\n
  *         MC_AHB3LPENSETR    HASH2      LL_AHB3_GRP1_EnableClockSleep\n
  *         MC_AHB3LPENSETR    RNG2       LL_AHB3_GRP1_EnableClockSleep\n
  *         MC_AHB3LPENSETR    CRC2       LL_AHB3_GRP1_EnableClockSleep\n
  *         MC_AHB3LPENSETR    HSEM       LL_AHB3_GRP1_EnableClockSleep\n
  *         MC_AHB3LPENSETR    IPCC       LL_AHB3_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_AHB3LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_AHB3LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB3 peripheral clocks in Sleep mode
  * @rmtoll MC_AHB3LPENCLRR    DCMI       LL_AHB3_GRP1_DisableClockSleep\n
  *         MC_AHB3LPENCLRR    CRYP2      LL_AHB3_GRP1_DisableClockSleep\n
  *         MC_AHB3LPENCLRR    HASH2      LL_AHB3_GRP1_DisableClockSleep\n
  *         MC_AHB3LPENCLRR    RNG2       LL_AHB3_GRP1_DisableClockSleep\n
  *         MC_AHB3LPENCLRR    CRC2       LL_AHB3_GRP1_DisableClockSleep\n
  *         MC_AHB3LPENCLRR    HSEM       LL_AHB3_GRP1_DisableClockSleep\n
  *         MC_AHB3LPENCLRR    IPCC       LL_AHB3_GRP1_DisableClockSleep
  *
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB3_GRP1_PERIPH_DCMI
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRYP2 (*)
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HASH2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_RNG2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_CRC2
  *         @arg @ref LL_AHB3_GRP1_PERIPH_HSEM
  *         @arg @ref LL_AHB3_GRP1_PERIPH_IPCC
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB3_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_AHB3LPENCLRR, Periphs);
}

/**
  * @}
  */

