zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_bus.h
/** @defgroup BUS_LL_EF_MLAHB MLAHB
  * @{
  */

/**
  * @brief  Enable MLAHB peripherals clock.
  * @rmtoll MC_MLAHBENSETR      RETRAMEN        LL_MLAHB_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_RETRAMEN
  * @retval None
  */
__STATIC_INLINE void LL_MLAHB_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_MLAHBENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_MLAHBENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if MLAHB peripheral clock is enabled or not
  * @rmtoll MC_MLAHBENSETR      RETRAMEN        LL_MLAHB_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_RETRAMEN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_MLAHB_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->MC_MLAHBENSETR, Periphs) == Periphs);
}

/**
  * @brief  Disable MLAHB peripherals clock.
  * @rmtoll MC_MLAHBENCLRR      RETRAMEN         LL_MLAHB_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_RETRAMEN
  * @retval None
  */
__STATIC_INLINE void LL_MLAHB_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_MLAHBENCLRR, Periphs);
}

/**
  * @brief  Enable MLAHB peripheral clocks in Sleep mode
  * @rmtoll MC_MLAHBLPENSETR    RETRAMEN         LL_MLAHB_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_RETRAMEN
  * @retval None
  */
__STATIC_INLINE void LL_MLAHB_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_MLAHBLPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_MLAHBLPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable MLAHB peripheral clocks in Sleep modes
  * @rmtoll MC_MLAHBLPENCLRR    RETRAMEN         LL_MLAHB_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_RETRAMEN
  * @retval None
  */
__STATIC_INLINE void LL_MLAHB_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_MLAHBLPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1 APB1
  * @{
  */

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll MC_APB1ENSETR      TIM2       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM3       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM4       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM5       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM6       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM7       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM12      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM13      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      TIM14      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      LPTIM1     LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      SPI2       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      SPI3       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      USART2     LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      USART3     LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      UART4      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      UART5      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      UART7      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      UART8      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      I2C1       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      I2C2       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      I2C3       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      I2C5       LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      SPDIF      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      CEC        LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      WWDG1      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      DAC12      LL_APB1_GRP1_EnableClock\n
  *         MC_APB1ENSETR      MDIOS      LL_APB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG1
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_APB1ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_APB1ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll MC_APB1ENSETR      TIM2       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM3       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM4       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM5       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM6       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM7       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM12      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM13      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      TIM14      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      LPTIM1     LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      SPI2       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      SPI3       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      USART2     LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      USART3     LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      UART4      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      UART5      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      UART7      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      UART8      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      I2C1       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      I2C2       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      I2C3       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      I2C5       LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      SPDIF      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      CEC        LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      WWDG1      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      DAC12      LL_APB1_GRP1_IsEnabledClock\n
  *         MC_APB1ENSETR      MDIOS      LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG1
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->MC_APB1ENSETR, Periphs) == Periphs);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll MC_APB1ENCLRR      TIM2       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM3       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM4       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM5       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM6       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM7       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM12      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM13      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      TIM14      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      LPTIM1     LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      SPI2       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      SPI3       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      USART2     LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      USART3     LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      UART4      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      UART5      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      UART7      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      UART8      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      I2C1       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      I2C2       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      I2C3       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      I2C5       LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      SPDIF      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      CEC        LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      DAC12      LL_APB1_GRP1_DisableClock\n
  *         MC_APB1ENCLRR      MDIOS      LL_APB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_APB1ENCLRR, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1RSTSETR     TIM2       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM3       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM4       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM5       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM6       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM7       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM12      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM13      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM14      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     LPTIM1     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     SPI2       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     SPI3       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     USART2     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     USART3     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART4      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART5      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART7      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART8      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     I2C1       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     I2C2       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     I2C3       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     I2C5       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     SPDIF      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     CEC        LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     DAC12      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     MCDIOS     LL_APB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTSETR, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll APB1RSTCLRR     TIM2       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM3       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM4       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM5       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM6       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM7       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM12      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM13      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM14      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     LPTIM1     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     SPI2       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     SPI3       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     USART2     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     USART3     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART4      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART5      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART7      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART8      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     I2C1       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     I2C2       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     I2C3       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     I2C5       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     SPDIF      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     CEC        LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     DAC12      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     MDIOS      LL_APB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTCLRR, Periphs);
}

/**
  * @brief  Enable APB1 peripheral clocks in Sleep mode
  * @rmtoll MC_APB1LPENSETR    TIM2       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM3       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM4       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM5       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM6       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM7       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM12      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM13      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    TIM14      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    LPTIM1     LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    SPI2       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    SPI3       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    USART2     LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    USART3     LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    UART4      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    UART5      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    UART7      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    UART8      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    I2C1       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    I2C2       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    I2C3       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    I2C5       LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    SPDIF      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    CEC        LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    WWDG1      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    DAC12      LL_APB1_GRP1_EnableClockSleep\n
  *         MC_APB1LPENSETR    MDIOS      LL_APB1_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG1
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_APB1LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_APB1LPENSETR, Periphs);
  (void)tmpreg;
}

