zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_bus.h
/**
  * @brief  Disable APB1 peripheral clocks in Sleep modes
  * @rmtoll MC_APB1LPENCLRR    TIM2       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM3       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM4       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM5       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM6       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM7       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM12      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM13      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    TIM14      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    LPTIM1     LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    SPI2       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    SPI3       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    USART2     LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    USART3     LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    UART4      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    UART5      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    UART7      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    UART8      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    I2C1       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    I2C2       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    I2C3       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    I2C5       LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    SPDIF      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    CEC        LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    WWDG1      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    DAC12      LL_APB1_GRP1_DisableClockSleep\n
  *         MC_APB1LPENCLRR    MDIOS      LL_APB1_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG1
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC12
  *         @arg @ref LL_APB1_GRP1_PERIPH_MDIOS
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_APB1LPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */

/**
  * @brief  Enable APB2 peripherals clock.
  * @rmtoll MC_APB2ENSETR      TIM1       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      TIM8       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      TIM15      LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      TIM16      LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      TIM17      LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      SPI1       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      SPI4       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      SPI5       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      USART6     LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      SAI1       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      SAI2       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      SAI3       LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      DFSDM1     LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      ADFSDM1    LL_APB2_GRP1_EnableClock\n
  *         MC_APB2ENSETR      FDCAN      LL_APB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_APB2ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_APB2ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @rmtoll MC_APB2ENSETR      TIM1       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      TIM8       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      TIM15      LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      TIM16      LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      TIM17      LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      SPI1       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      SPI4       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      SPI5       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      USART6     LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      SAI1       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      SAI2       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      SAI3       LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      DFSDM1     LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      ADFSDM1    LL_APB2_GRP1_IsEnabledClock\n
  *         MC_APB2ENSETR      FDCAN      LL_APB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->MC_APB2ENSETR, Periphs) == Periphs);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @rmtoll MC_APB2ENCLRR      TIM1       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      TIM8       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      TIM15      LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      TIM16      LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      TIM17      LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      SPI1       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      SPI4       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      SPI5       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      USART6     LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      SAI1       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      SAI2       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      SAI3       LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      DFSDM1     LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      ADFSDM1    LL_APB2_GRP1_DisableClock\n
  *         MC_APB2ENCLRR      FDCAN      LL_APB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_APB2ENCLRR, Periphs);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @rmtoll APB2RSTSETR     TIM1       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     TIM8       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     TIM15      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     TIM16      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     TIM17      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     SPI1       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     SPI4       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     SPI5       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     USART6     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     SAI1       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     SAI2       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     SAI3       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     DFSDM1     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSETR     FDCAN      LL_APB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB2RSTSETR, Periphs);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @rmtoll APB2RSTCLRR     TIM1       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     TIM8       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     TIM15      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     TIM16      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     TIM17      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     SPI1       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     SPI4       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     SPI5       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     USART6     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     SAI1       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     SAI2       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     SAI3       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     DFSDM1     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCLRR     FDCAN      LL_APB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB2RSTCLRR, Periphs);
}

/**
  * @brief  Enable APB2 peripheral clocks in Sleep mode
  * @rmtoll MC_APB2LPENSETR    TIM1       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    TIM8       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    TIM15      LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    TIM16      LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    TIM17      LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    SPI1       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    SPI4       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    SPI5       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    USART6     LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    SAI1       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    SAI2       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    SAI3       LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    DFSDM1     LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    ADFSDM1    LL_APB2_GRP1_EnableClockSleep\n
  *         MC_APB2LPENSETR    FDCAN      LL_APB2_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_APB2LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_APB2LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB2 peripheral clocks in Sleep modes
  * @rmtoll MC_APB2LPENCLRR    TIM1       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    TIM8       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    TIM15      LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    TIM16      LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    TIM17      LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    SPI1       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    SPI4       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    SPI5       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    USART6     LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    SAI1       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    SAI2       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    SAI3       LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    DFSDM1     LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    ADFSDM1    LL_APB2_GRP1_DisableClockSleep\n
  *         MC_APB2LPENCLRR    FDCAN      LL_APB2_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI3
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_APB2LPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB3 APB3
  * @{
  */

/**
  * @brief  Enable APB3 peripherals clock.
  * @rmtoll MC_APB3ENSETR      LPTIM2     LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      LPTIM3     LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      LPTIM4     LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      LPTIM5     LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      SAI4       LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      SYSCFG     LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      VREF       LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      TMPSENS    LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      PMBCTRL    LL_APB3_GRP1_EnableClock\n
  *         MC_APB3ENSETR      HDP        LL_APB3_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB3_GRP1_PERIPH_SAI4
  *         @arg @ref LL_APB3_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB3_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB3_GRP1_PERIPH_TMPSENS
  *         @arg @ref LL_APB3_GRP1_PERIPH_PMBCTRL
  *         @arg @ref LL_APB3_GRP1_PERIPH_HDP
  * @retval None
  */
__STATIC_INLINE void LL_APB3_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MC_APB3ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MC_APB3ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB3 peripheral clock is enabled or not
  * @rmtoll MC_APB3ENSETR      LPTIM2      LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      LPTIM3      LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      LPTIM4      LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      LPTIM5      LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      SAI4        LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      SYSCFG      LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      VREF        LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      TMPSENS     LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      PMBCTRL     LL_APB3_GRP1_IsEnabledClock\n
  *         MC_APB3ENSETR      HDP         LL_APB3_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB3_GRP1_PERIPH_SAI4
  *         @arg @ref LL_APB3_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB3_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB3_GRP1_PERIPH_TMPSENS
  *         @arg @ref LL_APB3_GRP1_PERIPH_PMBCTRL
  *         @arg @ref LL_APB3_GRP1_PERIPH_HDP
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB3_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->MC_APB3ENSETR, Periphs) == Periphs);
}

/**
  * @brief  Disable APB3 peripherals clock.
  * @rmtoll MC_APB3ENCLRR      LPTIM2      LL_APB3_GRP1_DisableClock\n
  *         MC_APB3ENCLRR      LPTIM3      LL_APB3_GRP1_DisableClock\n
  *         MC_APB3ENCLRR      LPTIM4      LL_APB3_GRP1_DisableClock\n
  *         MC_APB3ENCLRR      LPTIM5      LL_APB3_GRP1_DisableClock
  *         MC_APB3ENCLRR      SAI4        LL_APB3_GRP1_DisableClock
  *         MC_APB3ENCLRR      SYSCFG      LL_APB3_GRP1_DisableClock
  *         MC_APB3ENCLRR      VREF        LL_APB3_GRP1_DisableClock
  *         MC_APB3ENCLRR      TMPSENS     LL_APB3_GRP1_DisableClock
  *         MC_APB3ENCLRR      PMBCTRL     LL_APB3_GRP1_DisableClock
  *         MC_APB3ENCLRR      HDP         LL_APB3_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB3_GRP1_PERIPH_SAI4
  *         @arg @ref LL_APB3_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB3_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB3_GRP1_PERIPH_TMPSENS
  *         @arg @ref LL_APB3_GRP1_PERIPH_PMBCTRL
  *         @arg @ref LL_APB3_GRP1_PERIPH_HDP
  * @retval None
  */
__STATIC_INLINE void LL_APB3_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MC_APB3ENCLRR, Periphs);
}

